In [1]:
import pandas as pd
import warnings

#excepting warnings
warnings.filterwarnings('ignore')

In [2]:
#New Vehicles registered by class data
new_vehicles = pd.read_excel("data/new_vehicles_registered.xls",sheet_name="Fuel",engine="xlrd", skiprows=2, skipfooter=2)

#Road accidents by severity of injuries
injury_2010 = pd.read_csv("data/roadaccidentdatabyseverityofinjuries2010.csv", skipfooter=1)
injury_2011 = pd.read_csv("data/road_accident_data_by_severity_of_injuries_2011.csv", skipfooter=1)
injury_2012 = pd.read_csv("data/road_accident_data_by_severity_of_injuries_2012.csv", skipfooter=1)

#Road accidents by vehicle type
type_2010 = pd.read_csv("data/road_accident_data_by_vehicle_type_2010.csv", skipfooter=1)
type_2011 = pd.read_csv("data/road_accident_data_by_vehicle_type_2011.csv", skipfooter=1)
type_2012 = pd.read_csv("data/road_accident_data_by_vehicle_type_2012.csv", skipfooter=1)

In [3]:
new_vehicles.head()

      CLASS OF VEHICLE Fuel Type   2008  2009   2010   2011   2012
0           Motor Cars    Diesel   2457  1117    658   2642   5787
1                  NaN    Petrol  17765  4600  22397  50810  23184
2                  NaN  Electric      4     2      0   4414   2571
3  Motor Tricycles Car    Petrol     11    43     17     20      4
4      Motor Tricycles    Diesel   1877  2066   7361  14773   8194

Data Cleaning

In [4]:
new_vehicles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   CLASS OF VEHICLE  19 non-null     object
 1   Fuel Type         33 non-null     object
 2   2008              33 non-null     object
 3   2009              33 non-null     object
 4   2010              33 non-null     int64
 5   2011              33 non-null     object
 6   2012              33 non-null     object
dtypes: int64(1), object(6)
memory usage: 1.9+ KB

In [5]:
#Filling Na values with the values above it this is for the index class of vehicle column 
new_vehicles.fillna(method="ffill", inplace=True)

#Replacing "-" values to 0 to insert meaningfull values
new_vehicles.replace("-", 0, inplace=True)

#Changing the data types of the columns to do aggregations when needed
new_vehicles[[2008,2009,2010,2011,2012]] = new_vehicles[[2008,2009,2010,2011,2012]].apply(pd.to_numeric)

new_vehicles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   CLASS OF VEHICLE  33 non-null     object
 1   Fuel Type         33 non-null     object
 2   2008              33 non-null     int64
 3   2009              33 non-null     int64
 4   2010              33 non-null     int64
 5   2011              33 non-null     int64
 6   2012              33 non-null     int64
dtypes: int64(5), object(2)
memory usage: 1.9+ KB

In [6]:
new_vehicles.describe().T

      count          mean           std  min   25%    50%     75%       max
2008   33.0   8036.333333  27887.242233  0.0   4.0  118.0  1877.0  155950.0
2009   33.0   6184.090909  24054.569435  0.0   3.0  127.0  1117.0  135420.0
2010   33.0  10886.151515  37508.468301  0.0  14.0  293.0  2472.0  204808.0
2011   33.0  15921.848485  48313.590480  0.0  19.0  573.0  6649.0  253305.0
2012   33.0  12039.242424  36198.663226  0.0   5.0  479.0  6221.0  192231.0

In [9]:
injury_2010.head()

,Districts,Deaths Male,Deaths Female,Grievous Injury Male,Grievous Injury Female,Non Grievous Injury Male,Non Grievous Injury Female,Total
0,Ampara,70,9,253,40,584,112,1068
1,Anuradhapura,118,25,402,99,747,224,1615
2,Badulla (Badulla & Bandarawela Divisions),64,6,154,33,300,137,694
3,Batticaloa,54,4,107,25,320,68,578
4,Chilaw (Chilaw & Puttalam Divisions),100,19,198,26,377,78,798

In [10]:
injury_2010.drop(columns="Total", inplace=True)

In [15]:
# Changing the columns to match following year data
injury_2010.rename(columns={"Districts":"Location", "Deaths Male": "No.of Deaths Male", "Deaths Female":"No.of Deaths Female"}, inplace=True)

In [16]:
injury_2010.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 7 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Location                    25 non-null     object
 1   No.of Deaths Male           25 non-null     int64
 2   No.of Deaths Female         25 non-null     int64
 3   Grievous Injury Male        25 non-null     int64
 4   Grievous Injury Female      25 non-null     int64
 5   Non Grievous Injury Male    25 non-null     int64
 6   Non Grievous Injury Female  25 non-null     int64
dtypes: int64(6), object(1)
memory usage: 1.5+ KB

In [13]:
injury_2011.head()

,Location,No.of Deaths Male,No.of Deaths Female,Grievous Injury Male,Grievous Injury Female,Non Grievous Injury Male,Non Grievous Injury Female,Total
20,Polonnaruwa,67,14,183,42,354,91,751
21,Ratnapura,110,28,332,92,626,151,1339
22,Tangalle (Tangalle Division),86,13,235,41,341,109,825
23,Trincomalee (Trincomalee & Kantale Divisions),35,5,91,13,403,88,635
24,Vavuniya,15,2,52,12,166,48,295

In [14]:
injury_2012.head()

,Location,No.of Deaths Male,No.of Deaths Female,Grievous Injury Male,Grievous Injury Female,Non Grievous Injury Male,Non Grievous Injury Female,Total
0,Ampara,58,11,206,38,589,139,1041
1,Anuradhapura,134,18,391,76,746,222,1587
2,Badulla (Badulla & Bandarawela Divisions),51,8,141,34,323,152,709
3,Batticaloa,27,3,74,14,210,32,360
4,Chilaw (Chilaw & Puttalam Divisions),102,21,291,55,447,82,998